vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.LPC5526_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="usart_adapter" Cversion="1.0.0" condition="component.usart_adapter.condition_id">
      <description>Component usart_adapter</description>
      <files>
        <file category="header" name="components/uart/fsl_adapter_uart.h" projectpath="component/uart"/>
        <file category="sourceC" name="components/uart/fsl_adapter_usart.c" projectpath="component/uart"/>
        <file category="include" name="components/uart/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8524_adapter" Cversion="2.2.0" condition="component.wm8524_adapter.condition_id">
      <description>Component wm8524 adapter for single codec</description>
      <files>
        <file category="header" name="components/codec/port/wm8524/fsl_codec_wm8524_adapter.h" projectpath="codec/port/wm8524"/>
        <file category="sourceC" name="components/codec/port/wm8524/fsl_codec_wm8524_adapter.c" projectpath="codec/port/wm8524"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8524/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8904_adapter" Cversion="2.2.0" condition="component.wm8904_adapter.condition_id">
      <description>Component wm8904 adapter for single codec</description>
      <files>
        <file category="header" name="components/codec/port/wm8904/fsl_codec_wm8904_adapter.h" projectpath="codec/port/wm8904"/>
        <file category="sourceC" name="components/codec/port/wm8904/fsl_codec_wm8904_adapter.c" projectpath="codec/port/wm8904"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8904/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8960_adapter" Cversion="2.2.0" condition="component.wm8960_adapter.condition_id">
      <description>Component wm8960 adapter for single codecs</description>
      <files>
        <file category="header" name="components/codec/port/wm8960/fsl_codec_wm8960_adapter.h" projectpath="codec/port/wm8960"/>
        <file category="sourceC" name="components/codec/port/wm8960/fsl_codec_wm8960_adapter.c" projectpath="codec/port/wm8960"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8960/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8962_adapter" Cversion="2.2.0" condition="component.wm8962_adapter.condition_id">
      <description>Component wm8962 adapter for single codecs</description>
      <files>
        <file category="header" name="components/codec/port/wm8962/fsl_codec_wm8962_adapter.h" projectpath="codec/port/wm8962"/>
        <file category="sourceC" name="components/codec/port/wm8962/fsl_codec_wm8962_adapter.c" projectpath="codec/port/wm8962"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8962/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="LPC5526_header" Cversion="1.0.0" condition="device.CMSIS.condition_id">
      <description>Device LPC5526_cmsis</description>
      <files>
        <file category="header" name="devices/LPC5526/fsl_device_registers.h" projectpath="device"/>
        <file category="header" name="devices/LPC5526/LPC5526.h" projectpath="device"/>
        <file category="header" name="devices/LPC5526/LPC5526_features.h" projectpath="device"/>
        <file category="header" name="devices/LPC5526/LPC5526_COMMON.h" projectpath="device"/>
        <file category="header" name="devices/LPC5526/periph/PERI_ADC.h" projectpath="device/periph"/>
        <file category="header" name="devices/LPC5526/periph/PERI_AHB_SECURE_CTRL.h" projectpath="device/periph"/>
        <file category="header" name="devices/LPC5526/periph/PERI_ANACTRL.h" projectpath="device/periph"/>
        <file category="header" name="devices/LPC5526/periph/PERI_CASPER.h" projectpath="device/periph"/>
        <file category="header" name="devices/LPC5526/periph/PERI_CRC.h" projectpath="device/periph"/>
        <file category="header" name="devices/LPC5526/periph/PERI_CTIMER.h" projectpath="device/periph"/>
        <file category="header" name="devices/LPC5526/periph/PERI_DBGMAILBOX.h" projectpath="device/periph"/>
        <file category="header" name="devices/LPC5526/periph/PERI_DMA.h" projectpath="device/periph"/>
        <file category="header" name="devices/LPC5526/periph/PERI_FLASH.h" projectpath="device/periph"/>
        <file category="header" name="devices/LPC5526/periph/PERI_FLASH_CFPA.h" projectpath="device/periph"/>
        <file category="header" name="devices/LPC5526/periph/PERI_FLASH_CMPA.h" projectpath="device/periph"/>
        <file category="header" name="devices/LPC5526/periph/PERI_FLASH_KEY_STORE.h" projectpath="device/periph"/>
        <file category="header" name="devices/LPC5526/periph/PERI_FLEXCOMM.h" projectpath="device/periph"/>
        <file category="header" name="devices/LPC5526/periph/PERI_GINT.h" projectpath="device/periph"/>
        <file category="header" name="devices/LPC5526/periph/PERI_GPIO.h" projectpath="device/periph"/>
        <file category="header" name="devices/LPC5526/periph/PERI_HASHCRYPT.h" projectpath="device/periph"/>
        <file category="header" name="devices/LPC5526/periph/PERI_I2C.h" projectpath="device/periph"/>
        <file category="header" name="devices/LPC5526/periph/PERI_I2S.h" projectpath="device/periph"/>
        <file category="header" name="devices/LPC5526/periph/PERI_INPUTMUX.h" projectpath="device/periph"/>
        <file category="header" name="devices/LPC5526/periph/PERI_IOCON.h" projectpath="device/periph"/>
        <file category="header" name="devices/LPC5526/periph/PERI_MAILBOX.h" projectpath="device/periph"/>
        <file category="header" name="devices/LPC5526/periph/PERI_MRT.h" projectpath="device/periph"/>
        <file category="header" name="devices/LPC5526/periph/PERI_OSTIMER.h" projectpath="device/periph"/>
        <file category="header" name="devices/LPC5526/periph/PERI_PINT.h" projectpath="device/periph"/>
        <file category="header" name="devices/LPC5526/periph/PERI_PLU.h" projectpath="device/periph"/>
        <file category="header" name="devices/LPC5526/periph/PERI_PMC.h" projectpath="device/periph"/>
        <file category="header" name="devices/LPC5526/periph/PERI_POWERQUAD.h" projectpath="device/periph"/>
        <file category="header" name="devices/LPC5526/periph/PERI_PRINCE.h" projectpath="device/periph"/>
        <file category="header" name="devices/LPC5526/periph/PERI_PUF.h" projectpath="device/periph"/>
        <file category="header" name="devices/LPC5526/periph/PERI_RNG.h" projectpath="device/periph"/>
        <file category="header" name="devices/LPC5526/periph/PERI_RTC.h" projectpath="device/periph"/>
        <file category="header" name="devices/LPC5526/periph/PERI_SCT.h" projectpath="device/periph"/>
        <file category="header" name="devices/LPC5526/periph/PERI_SDIF.h" projectpath="device/periph"/>
        <file category="header" name="devices/LPC5526/periph/PERI_SPI.h" projectpath="device/periph"/>
        <file category="header" name="devices/LPC5526/periph/PERI_SYSCON.h" projectpath="device/periph"/>
        <file category="header" name="devices/LPC5526/periph/PERI_SYSCTL.h" projectpath="device/periph"/>
        <file category="header" name="devices/LPC5526/periph/PERI_USART.h" projectpath="device/periph"/>
        <file category="header" name="devices/LPC5526/periph/PERI_USB.h" projectpath="device/periph"/>
        <file category="header" name="devices/LPC5526/periph/PERI_USBFSH.h" projectpath="device/periph"/>
        <file category="header" name="devices/LPC5526/periph/PERI_USBHSD.h" projectpath="device/periph"/>
        <file category="header" name="devices/LPC5526/periph/PERI_USBHSH.h" projectpath="device/periph"/>
        <file category="header" name="devices/LPC5526/periph/PERI_USBPHY.h" projectpath="device/periph"/>
        <file category="header" name="devices/LPC5526/periph/PERI_UTICK.h" projectpath="device/periph"/>
        <file category="header" name="devices/LPC5526/periph/PERI_WWDT.h" projectpath="device/periph"/>
        <file category="include" name="devices/LPC5526/"/>
        <file category="include" name="devices/LPC5526/periph/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device" Cversion="1.0.0" condition="device.RTE.condition_id">
      <description>Rte_device</description>
      <files>
        <file category="header" attr="config" name="devices/LPC5526/template/RTE_Device.h" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/LPC5526/template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="LPC5526_linker" Cversion="1.0.0" condition="device.linker.condition_id">
      <description>Device LPC5526_linker</description>
      <files>
        <file condition="allOf.toolchains=mdk, device_ids=LPC5526.condition_id" category="linkerScript" attr="config" name="devices/LPC5526/arm/LPC5526_flash.scf" version="1.0.0" projectpath="LPC5526/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=LPC5526.condition_id" category="linkerScript" attr="config" name="devices/LPC5526/arm/LPC5526_ram.scf" version="1.0.0" projectpath="LPC5526/arm"/>
        <file condition="allOf.toolchains=armgcc, device_ids=LPC5526.condition_id" category="linkerScript" attr="config" name="devices/LPC5526/gcc/LPC5526_flash.ld" version="1.0.0" projectpath="LPC5526/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=LPC5526.condition_id" category="linkerScript" attr="config" name="devices/LPC5526/gcc/LPC5526_ram.ld" version="1.0.0" projectpath="LPC5526/gcc"/>
        <file condition="allOf.toolchains=iar, device_ids=LPC5526.condition_id" category="linkerScript" attr="config" name="devices/LPC5526/iar/LPC5526_flash.icf" version="1.0.0" projectpath="LPC5526/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=LPC5526.condition_id" category="linkerScript" attr="config" name="devices/LPC5526/iar/LPC5526_ram.icf" version="1.0.0" projectpath="LPC5526/iar"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="LPC5526" Cversion="1.0.0" condition="device.project_template.condition_id" isDefaultVariant="1">
      <description>Devices_project_template LPC5526</description>
      <files>
        <file category="header" attr="config" name="devices/LPC5526/project_template/board.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/LPC5526/project_template/board.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/LPC5526/project_template/clock_config.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/LPC5526/project_template/clock_config.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/LPC5526/project_template/pin_mux.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/LPC5526/project_template/pin_mux.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/LPC5526/project_template/peripherals.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/LPC5526/project_template/peripherals.c" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/LPC5526/project_template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="" Cversion="1.0.0" condition="device.startup.condition_id">
      <description>Device LPC5526_startup</description>
      <files>
        <file condition="allOf.toolchains=iar.condition_id" category="sourceAsm" attr="config" name="devices/LPC5526/iar/startup_LPC5526.s" version="1.0.0" projectpath="startup/iar"/>
        <file condition="allOf.toolchains=armgcc.condition_id" category="sourceAsm" attr="config" name="devices/LPC5526/gcc/startup_LPC5526.S" version="1.0.0" projectpath="startup/gcc"/>
        <file condition="allOf.toolchains=mdk.condition_id" category="sourceAsm" attr="config" name="devices/LPC5526/arm/startup_LPC5526.S" version="1.0.0" projectpath="startup/arm"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="LPC5526_system" Cversion="1.0.0" condition="device.system.condition_id">
      <description>Device LPC5526_system</description>
      <files>
        <file category="sourceC" name="devices/LPC5526/system_LPC5526.c" projectpath="device"/>
        <file category="header" name="devices/LPC5526/system_LPC5526.h" projectpath="device"/>
        <file category="include" name="devices/LPC5526/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ak4497" Cversion="2.1.2" condition="driver.ak4497.condition_id">
      <description>Driver ak4497</description>
      <RTE_Components_h>
#ifndef CODEC_AK4497_ENABLE
#define CODEC_AK4497_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/ak4497/fsl_ak4497.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/ak4497/fsl_ak4497.c" projectpath="codec"/>
        <file category="include" name="components/codec/ak4497/"/>
      </files>
    </component>
