vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.LPC5526_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="spi" Cversion="2.3.2" condition="driver.flexcomm_spi.condition_id">
      <description>SPI Driver</description>
      <files>
        <file category="sourceC" name="devices/LPC5526/drivers/fsl_spi.c" projectpath="drivers"/>
        <file category="header" name="devices/LPC5526/drivers/fsl_spi.h" projectpath="drivers"/>
        <file category="include" name="devices/LPC5526/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="spi_dma" Cversion="2.2.2" condition="driver.flexcomm_spi_dma.condition_id">
      <description>SPI Driver</description>
      <files>
        <file category="sourceC" name="devices/LPC5526/drivers/fsl_spi_dma.c" projectpath="drivers"/>
        <file category="header" name="devices/LPC5526/drivers/fsl_spi_dma.h" projectpath="drivers"/>
        <file category="include" name="devices/LPC5526/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="usart" Cversion="2.8.5" condition="driver.flexcomm_usart.condition_id">
      <description>usart Driver</description>
      <files>
        <file category="header" name="devices/LPC5526/drivers/fsl_usart.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC5526/drivers/fsl_usart.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC5526/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="usart_dma" Cversion="2.3.1" condition="driver.flexcomm_usart_dma.condition_id">
      <description>usart Driver</description>
      <files>
        <file category="header" name="devices/LPC5526/drivers/fsl_usart_dma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC5526/drivers/fsl_usart_dma.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC5526/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="fro_calib" Cversion="2.0.0" condition="driver.fro_calib.condition_id">
      <description>USB FRO Calibration Driver</description>
      <files>
        <file category="header" name="devices/LPC5526/drivers/fsl_fro_calib.h" projectpath="drivers"/>
        <file condition="allOf.toolchains=iar.condition_id" category="library" name="devices/LPC5526/iar/iar_lib_fro_calib_cm33_core0.a" projectpath="iar"/>
        <file condition="allOf.toolchains=mdk.condition_id" category="library" name="devices/LPC5526/arm/keil_lib_fro_calib_cm33_core0.lib" projectpath="arm"/>
        <file condition="allOf.toolchains=armgcc.condition_id" category="library" name="devices/LPC5526/gcc/libfro_calib_hardabi.a" projectpath="gcc"/>
        <file category="include" name="devices/LPC5526/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ft3267" Cversion="1.0.1" condition="driver.ft3267.condition_id">
      <description>Touch panel controller FT3267 driver</description>
      <files>
        <file category="header" name="components/touch/ft3267/fsl_ft3267.h" projectpath="touchpanel"/>
        <file category="sourceC" name="components/touch/ft3267/fsl_ft3267.c" projectpath="touchpanel"/>
        <file category="include" name="components/touch/ft3267/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ft5406" Cversion="1.0.0" condition="driver.ft5406.condition_id">
      <description>Driver ft5406</description>
      <files>
        <file category="header" name="components/touch/ft5406/fsl_ft5406.h" projectpath="touchpanel"/>
        <file category="sourceC" name="components/touch/ft5406/fsl_ft5406.c" projectpath="touchpanel"/>
        <file category="include" name="components/touch/ft5406/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ft6x06" Cversion="1.0.0" condition="driver.ft6x06.condition_id">
      <description>Driver ft6x06</description>
      <files>
        <file category="header" name="components/touch/ft6x06/fsl_ft6x06.h" projectpath="touchpanel"/>
        <file category="sourceC" name="components/touch/ft6x06/fsl_ft6x06.c" projectpath="touchpanel"/>
        <file category="include" name="components/touch/ft6x06/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="fxas21002cq" Cversion="1.0.0" condition="driver.fxas21002cq.condition_id">
      <description>Driver fxas21002cq</description>
      <files>
        <file category="header" name="components/sensor/fxas21002cq/fsl_fxas.h" projectpath="gyroscope"/>
        <file category="sourceC" name="components/sensor/fxas21002cq/fsl_fxas.c" projectpath="gyroscope"/>
        <file category="include" name="components/sensor/fxas21002cq/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="fxls8974cf" Cversion="1.0.0" condition="driver.fxls8974cf.condition_id">
      <description>Driver fxls8974cf</description>
      <files>
        <file category="header" name="components/sensor/fxls8974cf/fsl_fxls.h" projectpath="accel"/>
        <file category="sourceC" name="components/sensor/fxls8974cf/fsl_fxls.c" projectpath="accel"/>
        <file category="include" name="components/sensor/fxls8974cf/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="fxos8700cq" Cversion="1.0.0" condition="driver.fxos8700cq.condition_id">
      <description>Driver fxos8700cq</description>
      <files>
        <file category="header" name="components/sensor/fxos8700cq/fsl_fxos.h" projectpath="accel"/>
        <file category="sourceC" name="components/sensor/fxos8700cq/fsl_fxos.c" projectpath="accel"/>
        <file category="include" name="components/sensor/fxos8700cq/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="gint" Cversion="2.1.1" condition="driver.gint.condition_id">
      <description>GINT Driver</description>
      <files>
        <file category="header" name="devices/LPC5526/drivers/fsl_gint.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC5526/drivers/fsl_gint.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC5526/drivers/"/>
      </files>
    </component>
